** 2025
:LOGBOOK:
CLOCK: [2025-02-18 Tue 18:15]--[2025-02-18 Tue 19:15] =>  1:00
CLOCK: [2025-02-11 Tue 18:15]--[2025-02-11 Tue 19:15] =>  1:00
CLOCK: [2025-02-04 Tue 18:15]--[2025-02-04 Tue 19:15] =>  1:00
CLOCK: [2025-01-28 Tue 18:15]--[2025-01-28 Tue 19:15] =>  1:00
CLOCK: [2025-01-21 Tue 18:15]--[2025-01-21 Tue 19:15] =>  1:00
CLOCK: [2025-01-14 Tue 18:15]--[2025-01-14 Tue 19:15] =>  1:00
CLOCK: [2025-01-07 Tue 18:15]--[2025-01-07 Tue 19:15] =>  1:00
:END:

#+CAPTION: Pilates Log 2025 (Notes from attending [[https://symmetrypilates.co.uk/][Symmetry Pilates]] with Sam Webster.)
#+NAME: pilates-log-2024
| Date                   | Notes                                                                                              | Exercise(s) to practice                                                                                                                                                                                                                                             |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-03-04 Tue 19:38] | Good session, lots of legs and hips                                                                | Warm up with usual hips, arching hand over but with a rotation of raised arm down to opposite side. Roll downs plus on toes.                                                                                                                                        |
|                        |                                                                                                    | Dead-bug opposite arms and legs, then with head on floor straight arms and legs out (opposite). Something with double legs but can't remember, may have had head and shoulders up.                                                                                  |
|                        |                                                                                                    | Tree...one leg flat, other raised to chest with hands behind knee, roll back a little, pull forward, should be sitting up very straight. Gently roll back and straighten leg out balancing and walk hand sup get, then go back down to horizontal walking hands     |
|                        |                                                                                                    | down the leg keeping shoulders off the floor and core engaged. Walk hands down the leg and return to sitting. Repeat. Quite hard!                                                                                                                                   |
|                        |                                                                                                    | Open book followed by leg circles, small, medium large in alternating directions, about eight sets. Raised upper leg, lift lower leg to meet, double leg lifts, then fish.                                                                                          |
|                        |                                                                                                    | Raise upper leg and with foot bent turn toes out then int, repeat followed by U/smile swings, making sure not to let hips wobble.                                                                                                                                   |
|                        |                                                                                                    | On front with hands by shoulders, elbows anchored on side, push pelvis down toes on ground raise knees and roll ball out with sternum keeping head down, repeat x5 then extend arms out above head/shoulders.                                                       |
|                        |                                                                                                    | Seal roles, always good fun :-)                                                                                                                                                                                                                                     |
|                        |                                                                                                    | Also did roll overs earlier in the session, do more of these they're good workout for core (along with the obligatory 100s)                                                                                                                                          |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-02-25 Tue 20:05] | Larger class today, bit less strenuous than last week                                              | Hips and ankle raises, sliding down wall, roll downs                                                                                                                                                                                                                |
|                        |                                                                                                    | Ring for half-roll backs onto lower back then diving head forward to knees, straighten up and repeat.                                                                                                                                                               |
|                        |                                                                                                    | Use ring to stretch leg dynamically whilst lying on back keeping other leg anchored on floor, straight up, across and out to side.                                                                                                                                  |
|                        |                                                                                                    | Bridge with ring on outside.                                                                                                                                                                                                                                        |
|                        |                                                                                                    | Leg circles in frog with ring between (or possibly around) ankles.                                                                                                                                                                                                  |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-02-18 Tue 20:24] | Great session, lots of core                                                                        | Started with ball and foot work, sideways over toes, midfoot, heel, then length wise (both feet)                                                                                                                                                                    |
|                        |                                                                                                    | Hip stirring, then raising up on toes followed by crossing arms in front at chest height and lowering down with back straight (sliding down a wall), repeat the slides a few times hold on last.                                                                    |
|                        |                                                                                                    | Weights in arms and swings back and forth with one foot behind other, then raise opposite knee and arm and hold, repeat. On last hold....and close eyes for five seconds.                                                                                           |
|                        |                                                                                                    | Table-top, opposite arms and legs extend and come back. Then co-ordination with leg going out to 45 degrees, arm back, leg outs out sideways (don't let hips lift) whilst arm circles out to side                                                                   |
|                        |                                                                                                    | bring leg and arm in at the same time, switch sides and repeat. Seemed hard to co-ordinate the circling compared to just extending!                                                                                                                                 |
|                        |                                                                                                    | Dead bug with weights, one leg out and arms back then circle round to bring arms back in. Opposite leg repeating x10 each side then both legs. Involved lying back and head/shoulders raising up                                                                    |
|                        |                                                                                                    | in opposition. Can't quite remember exactly, finished with double legs, was knackering.                                                                                                                                                                             |
|                        |                                                                                                    | Raise head and shoulders up, legs in table top and dust top of table with legs in circles.                                                                                                                                                                          |
|                        |                                                                                                    | 100s followed this, which was knackering on the core.                                                                                                                                                                                                               |
|                        |                                                                                                    | Roll-overs but starting with legs vertical and coming back to that position. Then "corkscrew" where when lowering do so on one side, roll over to other side when legs vertical, then roll back                                                                     |
|                        |                                                                                                    | on the opposite side, hard and very good for imbalance in back (something I seem to have when sat at desk).                                                                                                                                                         |
|                        |                                                                                                    | Open-book, side kicks and leg circles (both directions) with arm on floor, hand supporting head. Repeat but with elbow resting on floor, hand supporting head and opposite hand on back of head.                                                                    |
|                        |                                                                                                    | Important to make sure I don't twist (picked up on this multiple times), engage core, keep chest in and don't let hips rotate. Hard! Done on both sides                                                                                                             |
|                        |                                                                                                    | Then, one knee other leg out-stretched (forward of waste if needed is easier) and lower out so opposite arm is on floor. Upper arm over head, lift leg up to hip height (hard!), then forward kicks                                                                 |
|                        |                                                                                                    | (even harder), then circles both ways (really hard!).                                                                                                                                                                                                               |
|                        |                                                                                                    | Back stretches, sit with toes pointed, hands flat on ground by thighs and slide forward when at extreme should be pulling stomach and rubs in and stretching neck, shoulders should be forward of                                                                   |
|                        |                                                                                                    | hips, staying leaning forward lift toes and raise arms up to 45 degrees, extending neck.                                                                                                                                                                            |
|                        |                                                                                                    | Back release starting at low back and moving up, balls either side of spine, knees rocking, mid-spine arms go back over head, at tope (shoulders), don't bother moving knees.                                                                                       |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-02-11 Tue 20:14] | Another great session, really feel like Sam is pushing us now.                                     | Warm up hips, stretch over, roll downs                                                                                                                                                                                                                              |
|                        | Lots of band work, basically everything with band                                                  | Band and open chest, arms out in front and open, then over head, band behind legs and pull forward reverse with band in front of legs and pulling back.                                                                                                             |
|                        |                                                                                                    | Sit with band round feet, roll back a little and pull arms up to chest (bicep curls).                                                                                                                                                                               |
|                        |                                                                                                    | Band round foot for leg circles, ham string stretch (really push heel, keep knee straight and pull back), repeat out to both sides. Bicycles both ways with band.                                                                                                   |
|                        |                                                                                                    | Band behind head cradling, lift up and toe tap x10 each side, shoulders off floor, then opposite elbow to knee and alternate.                                                                                                                                       |
|                        |                                                                                                    | Hundreds with band.                                                                                                                                                                                                                                                 |
|                        |                                                                                                    | Side line, open book, arm circles, band round knees and clam, raised clam, hold and extend, leg circles both directions, highland fling (flow sequence no resting)                                                                                                  |
|                        |                                                                                                    | Lie on front band underneath, pubic bone pushing into ground, roll ball forward, shoulder blades pushing in to touch and lift arms.                                                                                                                                 |
|                        |                                                                                                    | Lie on front band above, pubic bone pushing into ground, roll ball forward, shoulder pushing in, lift arms and bring forward over the head                                                                                                                          |
|                        |                                                                                                    | Myofascial release on glutes (both at same time) and then each side                                                                                                                                                                                                 |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-02-04 Tue 22:39] | Great session, had to work hard. Weights throughout with core and legs.                            | Hips, side stretch and roll down to warm up                                                                                                                                                                                                                         |
|                        |                                                                                                    | Weights in hand , one step back swing arms, after a set (6-10) keep going but raise one leg to table top, hold then step back and repeat swings.                                                                                                                    |
|                        |                                                                                                    | After several sets hold and swing arms, quite tricky, especially with heavier weights.                                                                                                                                                                              |
|                        |                                                                                                    | 100s with weights                                                                                                                                                                                                                                                   |
|                        |                                                                                                    | Leg circles followed by lots of leg work (I asked for it), all starting with raising shoulders off the ground and tucking chin to engage                                                                                                                            |
|                        |                                                                                                    | the upper torso, then...scissors with legs straight, switching (having weights over forehead and crossing shoulder to opposite knee).                                                                                                                               |
|                        |                                                                                                    | Double leg raises, bicycle leg, single both sides then double                                                                                                                                                                                                       |
|                        |                                                                                                    | Open book, side kicks (x2 forward, x1 back) always keep hips in-line, engage stomach as you kick, don't hitch hip.                                                                                                                                                  |
|                        |                                                                                                    | Lower leg lift x10 then circle both ways (x8-10)                                                                                                                                                                                                                    |
|                        |                                                                                                    | Flow sequence, three sets of the following, each repeated x5 figure of 8, fish/side slide, U-s with leg.                                                                                                                                                            |
|                        |                                                                                                    | Back and arms lie on front, push pelvis in hard, legs and arms (with weights) extended, mat width apart. Lift opposite sides.                                                                                                                                       |
|                        |                                                                                                    | Weights at side, legs together raise arms, hard but good for triceps.                                                                                                                                                                                               |
|                        |                                                                                                    | Legs in frog (bent at knee with heels touching), raise knees, repeat then hold.                                                                                                                                                                                     |
|                        |                                                                                                    | On all 4's straight back no dipping or bending, raise opposite hand/foot then lift toe of foot on floor, hard! Hold repeat, then tuck raised                                                                                                                        |
|                        |                                                                                                    | arm under torso (keeping toes off the ground). Hard!                                                                                                                                                                                                                |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-01-28 Tue 21:50] | Great session, lots of work on core and hips                                                       | Hips and over arm stretches to start, roll-downs and standing on tip-toe (x10 repeats with heels together hold then slide up and down wall)                                                                                                                         |
|                        |                                                                                                    | Ring out in front elbows up and chest forward, push don't curl inwards. Above head then behind back (always impossible but keep arms straight)                                                                                                                      |
|                        |                                                                                                    | Leg work opening ham strings, ring around ball of foot and roll back keeping other leg on floor. Really push the heel to wards the ceiling and                                                                                                                      |
|                        |                                                                                                    | get as high as possible. Then bend and straighten, really push with heel and make sure other leg/hip is relaxed and doesn't raise. Repeat going                                                                                                                     |
|                        |                                                                                                    | across the body then out to the side.                                                                                                                                                                                                                               |
|                        |                                                                                                    | Opposite (I think) hand and foot with ring, other hand behind head, roll up and across. Followed by switching.                                                                                                                                                      |
|                        |                                                                                                    | Baby scissor kicks then full scissor kicks (x10)                                                                                                                                                                                                                    |
|                        |                                                                                                    | Side line followed by the following done quickly in sequence x10 each : raised clam, finish open and extend and close legs (frog like turning toes in and straightening)                                                                                            |
|                        |                                                                                                    | x10 big circles each direction; 3 sets of highland fling (toes, heels, heel/knee progressing through sets), forward kick, x6-8 fish slides on side lower arm under ear                                                                                              |
|                        |                                                                                                    | flat slide hand down side resisting with head bringing torso off the ground. Finally ring between legs for double leg raises.                                                                                                                                       |
|                        |                                                                                                    | Front stretches with ring out front arms straight push down, keep head above shoulders all the time, lift sternum, after a few repeats go further by pulling ring back                                                                                              |
|                        |                                                                                                    | after pushing down.                                                                                                                                                                                                                                                 |
|                        |                                                                                                    | Ring round ankles and straighten legs, opens chest, pull shoulders together. Extend by trying to raise knees                                                                                                                                                        |
|                        |                                                                                                    | Bridge with ring between knees was really good, arms above head eventually and then make harder by holding and raising alternate legs                                                                                                                               |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [2025-01-21 Tue 21:18] | Great session, lots of core work! Mostly with large soft ball                                      | Loosen hips, stretch over both sides, cross arms and bend over arms out behind and bend down.                                                                                                                                                                       |
|                        |                                                                                                    | Ball under hips into dead bug and extend opposite arm and leg, alternate (try not to lose balance!). With legs in table open one knee out to the side, keeping chest anchored and other knee straight. Finally both knees over almost as far as tipping then back.  |
|                        |                                                                                                    | All leg (core!) exercises with ball under shoulders, hands behind head and curling up high. Alternate leg circles, both leg circles (both directions x5-8)                                                                                                          |
|                        |                                                                                                    | One leg up in table top other straight, hold ball with same hand, opposite hand behind head, lean up and bring elbow of hand behind head to hold ball in place and put both hands behind head. Hold and take goes at trying to push ball up towards ceiling,        |
|                        |                                                                                                    | keeping same side shoulder off floor. Really hard!                                                                                                                                                                                                                  |
|                        |                                                                                                    | Side line with ball between legs followed by double leg raises with ball between ankles and little switches at the end. Move on to lower leg raises (upper leg resting on ball) x8-10 raises followed by circles in both directions, point toes, keep core engaged. |
|                        |                                                                                                    | Figure of 8 in both directions (x8-10) to warm down.                                                                                                                                                                                                                |
|                        |                                                                                                    | Back work with ball between thighs, squeeze tight and push pelvic bone down throughout. Start with raising sternum up and double hand salute, holding then back down (x3-5) then repeat but extend arms out and back in (x3-5) on last hold and breathe.            |
|                        |                                                                                                    | Ball still between thighs, up onto toes, hands beside chest, elbows tucked in and by chest too, lift knees then lift hands off the ground 3-5cm keeping elbows in-line.                                                                                             |
|                        |                                                                                                    | Kneeling planks with ball between thighs, make sure chest isn't flared, shoulder blades are pulling back into each other, from hands and knees lift knees slightly and hold, head up and sternum out but no flaring chest.                                          |
|                        |                                                                                                    | Full plank in similar as with kneeling but after a few roll to side, keeping ball between legs and lifting into side plank, don't let hips drop, open upper arm out, this was challenging but felt good when it worked.                                             |
|                        |                                                                                                    | Finished with some myofascial of shoulders, glutes and ankles, ankles is good and should be done more regularly, ball under fleshy part near ankle, lean forward, pull toes back, push heel away and down. Not comfortable but good, roll to both sides.            |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| <2025-01-14 Tue 20:27> | Really good session, smaller class today (4 people), lots of band work for arms/shoulders, core,   | Warm up hips, stretch over, roll downs.                                                                                                                                                                                                                             |
|                        | legs                                                                                               | Band and open chest with elbows anchored on chest, then arms straight out front and open. Stand on band on one side and lift in front to above head, repeat x10 then on last out to side lowering to horizontal with shoulders, don't                               |
|                        |                                                                                                    | flare the chest. Band over thighs, arms straight and hands behind back.                                                                                                                                                                                             |
|                        |                                                                                                    | Theraband round feet in sitting and roll back onto lower back. Double band round feet, knees apart, arms hugging knees and roll like a ball, pausing on back and not going onto feet when coming forward.                                                           |
|                        |                                                                                                    | Band as cradle for head and raise head and shoulders up, extend one leg, other in table top, switch extending leg out straight. Then with head in band opposite elbow/knee, first with toe tapping down then leg going from table top to                            |
|                        |                                                                                                    | straight, then with legs straight. Double leg raises and finally hundreds.                                                                                                                                                                                          |
|                        |                                                                                                    | Side line starting with open book, band round knees, clam, raised clam, extend legs pointed going out, bent coming back. Front kicks, two forwards, one back. Highland fling then big scissor kicks. All very hard with band.                                       |
|                        |                                                                                                    | Front with band underneath hips, palms facing inwards, push hips/groin down and lift sternum (keep head down) and lift arms, next lift arms then extend out to side.                                                                                                |
|                        |                                                                                                    | Hands and knees pull pubic bone up, shoulder blades back, sternum up and head straight, lift knees. Next move into plank position keeping core engaged and raise alternate legs.                                                                                    |
|                        |                                                                                                    | Myofascial release was good again, started on thighs at top, push pubic bone down and raise foot, then bring foot up to vertical and roll legs left and right. Pause when finding a pain point and rest there. Repeat moving down the                               |
|                        |                                                                                                    | leg. Next glute just behind the hip on side, then move backwards. Finally front of hip just inside, almost on front, but raise upper torso up to increase pressure.                                                                                                 |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| <2025-01-07 Tue 21:25> | Nice session after a long break. Started doing 15 minute sessions at home on my own based on book. | Warm up hips and arms/shoulders with circling weights then twisting through, squaring hips on opposite walls.                                                                                                                                                       |
|                        | Lots of weight work and good myofascial release.                                                   | Roll backs with weights, starting short, diving forward with weights low and head to knees returning to upright. A few at each height, curling back further down to eventually end with arms going overhead.                                                        |
|                        |                                                                                                    | Kneeling with weights arms out straight at shoulder heigh and leaning back, keeping core engaged and three boxes straight, repeat. Then repeat with arms above head (greater resistance). Don't arch back or bend and keep ribs down!                               |
|                        |                                                                                                    | Leg work was double leg raises with arms opening out (not enough space for circles), alternate side (remember to get lower shoulder off the floor) and more I can't remember always remember, but do remember to always keep lower back                             |
|                        |                                                                                                    | on the floor and engaged, shouldn't raise off.                                                                                                                                                                                                                      |
|                        |                                                                                                    | Side line was open book, raised clams, leg extensions, leg circles (both directions), lower leg raises and double leg raises, 10-12 of each.                                                                                                                        |
|                        |                                                                                                    | Bridge but with feet on weights, start with heels on floor, pelvic tilt first (repeat a few times) then move onto raising into bridge, as soon as back comes off floor toes should touch in fron of weights. Repeat. At the end try and                             |
|                        |                                                                                                    | roll weights forward and back 10 times (hard on the hamstrings!)                                                                                                                                                                                                    |
|                        |                                                                                                    | Back work lie on front arms at side raise sternum up whilst pushing pelvis down and into the floor, lift arms. Starfish with arms out and raising opposie arm/leg.                                                                                                  |
|                        |                                                                                                    | Good myofascial release down the front of the thighs/quads, starting at top lying on two balls at once, pushing pelvis into the floor then raising feet off the ground and lowering followed by bending knees up then gently rocking                                |
|                        |                                                                                                    | side to side. Repeat with balls lower down and then again nearer the knees. Pause on pain points and hold until relaxed.                                                                                                                                            |
|                        |                                                                                                    | Shoulder/upper back release lying on balls, arms up behind head, goal post out to v and then circles.                                                                                                                                                               |
|------------------------+----------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
